UKS/src/Catalogs/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Оборудование</name>
  <comment>Оборудование</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <comment>Инвентарныйномер</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размещение</name>
    <comment>Размещение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИПАдрес</name>
    <comment>ИП адрес принтера</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <comment>Логин</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <comment>Пароль</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <comment>Изготвитель</comment>
    <type>
      <types>CatalogRef.Изготовители</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОборудования</name>
    <comment>Вид оборудования</comment>
    <type>
      <types>CatalogRef.ВидыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриобритения</name>
    <comment>Дата покупки оборудования</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Списан</name>
    <comment>Списан</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСписания</name>
    <comment>Дата списания</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/Catalogs/Оборудование/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьСписокНаСервере()
	
	ТаблицаРезультата.Очистить();
	
	Если ЗначениеЗаполнено(ДатаПриобритения) Тогда
		ДатаНачала = НачалоДня(ДатаПриобритения.ДатаНачала);
		ДатаОкончания = КонецДня(ДатаПриобритения.ДатаОкончания);
	Иначе
		ДатаНачала = НачалоДня(ДатаПриобритения.ДатаНачала);
		ДатаОкончания = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Оборудование.Наименование КАК Наименование,
		|	Оборудование.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	Оборудование.Размещение КАК Размещение,
		|	Оборудование.ВидОборудования КАК ВидОборудования,
		|	Оборудование.ДатаПриобритения КАК ДатаПриобритения,
		|	Оборудование.ОтветственноеЛицо КАК ОтветственноеЛицо,
		|	Оборудование.Ссылка КАК Ссылка,
		|	Оборудование.СерийныйНомер КАК СерийныйНомер,
		|	Оборудование.Родитель КАК Родитель,
		|	Оборудование.ОтветственноеЛицо.Подразделение КАК ОтветственноеЛицоПодразделение
		|ИЗ
		|	Справочник.Оборудование КАК Оборудование
		|ГДЕ
		|	Оборудование.ПометкаУдаления = ЛОЖЬ
		|	И Оборудование.Списан = ЛОЖЬ
		|	И Оборудование.ДатаПриобритения МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.Текст = Запрос.Текст+Символы.ПС+"И Оборудование.ОтветственноеЛицо.Подразделение = &Подразделение";
		Запрос.УстановитьПараметр("Подразделение",Подразделение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОборудования) Тогда
		Запрос.Текст = Запрос.Текст+Символы.ПС+"И Оборудование.Наименование ПОДОБНО &Наименование";
		Запрос.УстановитьПараметр("Наименование","%"+СокрЛП(ИмяОборудования)+"%");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидОборудования) Тогда
		Запрос.Текст = Запрос.Текст+Символы.ПС+"И Оборудование.ВидОборудования = &ВидОборудования";
		Запрос.УстановитьПараметр("ВидОборудования",ВидОборудования);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НН = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НН = НН+1;
		НоваяСтрока = ТаблицаРезультата.Добавить();
		НоваяСтрока.НомерСтроки = НН;
		НоваяСтрока.Наименование = ВыборкаДетальныеЗаписи.Наименование;
		НоваяСтрока.СерийныйНомер = ВыборкаДетальныеЗаписи.СерийныйНомер;
		НоваяСтрока.ИнвентарныйНомер = ВыборкаДетальныеЗаписи.ИнвентарныйНомер;
		НоваяСтрока.ВидОборудования = ВыборкаДетальныеЗаписи.ВидОборудования;
		НоваяСтрока.ДатаПриобритения = ВыборкаДетальныеЗаписи.ДатаПриобритения;
		НоваяСтрока.Сотрудник = ВыборкаДетальныеЗаписи.ОтветственноеЛицо;
		НоваяСтрока.Размещение = ВыборкаДетальныеЗаписи.Размещение;
		НоваяСтрока.Ссылка = ВыборкаДетальныеЗаписи.Ссылка;
		НоваяСтрока.Родитель = ВыборкаДетальныеЗаписи.Родитель;
	КонецЦикла;
	
	ТаблицаРезультата.Сортировать("ВидОборудования,Наименование,Размещение");
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьСписокНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМакет(ИмяМакета)
	
	Возврат Справочники.Оборудование.ПолучитьМакет(ИмяМакета);
	
КонецФункции

&НаСервере
Функция СформироватьСписокПечатиНаСервере()
	
	МакетПечати = ПолучитьМакет("СписокОборудования");
	ТаблицаПечати = Новый ТабличныйДокумент;
	
	МакетЗаголовок = МакетПечати.ПолучитьОбласть("Заголовок");
	ЗаголовокДата = МакетПечати.ПолучитьОбласть("ЗаголовокДата");
	ШапкаТаблицы = МакетПечати.ПолучитьОбласть("ШапкаТаблицы");
	СтрокаТаблицы = МакетПечати.ПолучитьОбласть("СтрокаТаблицы");
	ТаблицаПечати.Вывести(МакетЗаголовок);
	
	Если ЗначениеЗаполнено(ДатаПриобритения) Тогда
		ЗаголовокДата.Параметры.ДатаПриобритения = "ПРИОБРЕТЕН: "+ДатаПриобритения;
	Иначе
		ЗаголовокДата.Параметры.ДатаПриобритения = "ПРИОБРЕТЕН За весь период";
	КонецЕсли;
	ТаблицаПечати.Вывести(ЗаголовокДата);
	
	Если ЗначениеЗаполнено(ВидОборудования) Тогда
		ЗаголовокВидОборудования = МакетПечати.ПолучитьОбласть("ЗаголовокВидОборудования");
		ЗаголовокВидОборудования.Параметры.ВидОборудования = "ОТБОР: "+ВидОборудования.Наименование;
		ТаблицаПечати.Вывести(ЗаголовокВидОборудования);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ЗаголовокПодразделение = МакетПечати.ПолучитьОбласть("ЗаголовокПодразделение");
		ЗаголовокПодразделение.Параметры.Подразделение = "ОТБОР: "+Подразделение.Наименование;
		ТаблицаПечати.Вывести(ЗаголовокПодразделение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяОборудования) Тогда
		ЗаголовокНаименование = МакетПечати.ПолучитьОбласть("ЗаголовокНаименование");
		ЗаголовокНаименование.Параметры.ИмяОборудования = "ОТБОР: "+ИмяОборудования;
		ТаблицаПечати.Вывести(ЗаголовокНаименование);
	КонецЕсли;
	
	ТаблицаПечати.Вывести(ШапкаТаблицы);
	
	НН = 0;
	Для Каждого СтрокаРезультата Из ТаблицаРезультата Цикл
		НН = НН+1;
		СтрокаТаблицы.Параметры.Заполнить(СтрокаРезультата);
		СтрокаТаблицы.Параметры.НомерСтроки = НН;
		ТаблицаПечати.Вывести(СтрокаТаблицы);
	КонецЦикла;
	
	ТаблицаПечати.АвтоМасштаб = Истина;
	ТаблицаПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	Возврат ТаблицаПечати;
	
КонецФункции

&НаКлиенте
Процедура ПечатьСписок(Команда)
	
	Результат = СформироватьСписокПечатиНаСервере();
	Результат.Показать("Список оборудования");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьИтоги(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Сортировать(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры
